In [1]:
import pandas as pd

In [2]:
verbose=True

In [3]:
df = pd.read_csv(r'csv/enrollments.csv')

C:\Users\s.baig\AppData\Local\Temp\ipykernel_17988\3555196855.py:1: DtypeWarning: Columns (12,13) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv(r'csv/enrollments.csv')

In [4]:
# Convert year float to dt object
df['year'] = pd.to_datetime(df['year'], format='%Y')
df['year'] = df['year'].apply(lambda x: pd.to_datetime(x))

In [5]:
df.head()

,country,countrycode,region,incomegroup,iau_id,iau_id1,eng_name,orig_name,foundedyr,yrclosed,...,divisions,total_fields,unique_fields,specialized,merger,noiau,year,students5_interpolated,students5_extrapolated,students5_estimated
0,afghanistan,AFG,South Asia,Low income,IAU-000810,IAU-000810-1,Alberoni University,Alberoni University,1998.0,NaN,...,NaN,NaN,NaN,0.0,0.0,0.0,2000-01-01,NaN,1546.0,1546.0
1,afghanistan,AFG,South Asia,Low income,IAU-000810,IAU-000810-1,Alberoni University,Alberoni University,1998.0,NaN,...,NaN,NaN,NaN,0.0,0.0,0.0,2005-01-01,NaN,2106.0,2106.0
2,afghanistan,AFG,South Asia,Low income,IAU-000810,IAU-000810-1,Alberoni University,Alberoni University,1998.0,NaN,...,NaN,NaN,NaN,0.0,0.0,0.0,2010-01-01,2317.0,2317.0,2317.0
3,afghanistan,AFG,South Asia,Low income,IAU-000810,IAU-000810-1,Alberoni University,Alberoni University,1998.0,NaN,...,NaN,NaN,NaN,0.0,0.0,0.0,2015-01-01,1835.0,1835.0,1835.0
4,afghanistan,AFG,South Asia,Low income,IAU-000810,IAU-000810-1,Alberoni University,Alberoni University,1998.0,NaN,...,9.0,22.0,21.0,0.0,0.0,0.0,2020-01-01,NaN,1901.0,1901.0

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 161560 entries, 0 to 161559
Data columns (total 27 columns):
 #   Column                  Non-Null Count   Dtype
---  ------                  --------------   -----
 0   country                 161560 non-null  object
 1   countrycode             159698 non-null  object
 2   region                  159698 non-null  object
 3   incomegroup             159691 non-null  object
 4   iau_id                  161553 non-null  object
 5   iau_id1                 161553 non-null  object
 6   eng_name                161553 non-null  object
 7   orig_name               138474 non-null  object
 8   foundedyr               161553 non-null  float64
 9   yrclosed                460 non-null     float64
 10  private01               161553 non-null  float64
 11  coordinates             138352 non-null  object
 12  latitude                138352 non-null  object
 13  longitude               138352 non-null  object
 14  phd_granting            161553 non-null  float64
 15  m_granting              21208 non-null   float64
 16  b_granting              21208 non-null   float64
 17  divisions               21208 non-null   float64
 18  total_fields            21208 non-null   float64
 19  unique_fields           21208 non-null   float64
 20  specialized             161553 non-null  float64
 21  merger                  161553 non-null  float64
 22  noiau                   161553 non-null  float64
 23  year                    161553 non-null  datetime64[ns]
 24  students5_interpolated  53960 non-null   float64
 25  students5_extrapolated  105598 non-null  float64
 26  students5_estimated     142831 non-null  float64
dtypes: datetime64[ns](1), float64(15), object(11)
memory usage: 33.3+ MB

In [7]:
# Drop useless columns
df.drop(['iau_id', 'iau_id1','yrclosed','orig_name','students5_interpolated','students5_extrapolated','divisions','total_fields','merger','unique_fields','noiau','specialized'], axis=1, inplace=True)
cols_name_map = {'country': 'Country', 'eng_name': 'University', 'foundedyr': 'Founded in', 'b_granting': 'Bachelor', 'm_granting': 'Master', 'phd_granting': 'PhD', 'students5_estimated': 'Number of Student'}
# Rename
df = df.rename(columns=cols_name_map)
df

,Country,countrycode,region,incomegroup,University,Founded in,private01,coordinates,latitude,longitude,PhD,Master,Bachelor,year,Number of Student
0,afghanistan,AFG,South Asia,Low income,Alberoni University,1998.0,0.0,"35.1270053, 69.3193192",35.1270053,69.319319,0.0,NaN,NaN,2000-01-01,1546.0
1,afghanistan,AFG,South Asia,Low income,Alberoni University,1998.0,0.0,"35.1270053, 69.3193192",35.1270053,69.319319,0.0,NaN,NaN,2005-01-01,2106.0
2,afghanistan,AFG,South Asia,Low income,Alberoni University,1998.0,0.0,"35.1270053, 69.3193192",35.1270053,69.319319,0.0,NaN,NaN,2010-01-01,2317.0
3,afghanistan,AFG,South Asia,Low income,Alberoni University,1998.0,0.0,"35.1270053, 69.3193192",35.1270053,69.319319,0.0,NaN,NaN,2015-01-01,1835.0
4,afghanistan,AFG,South Asia,Low income,Alberoni University,1998.0,0.0,"35.1270053, 69.3193192",35.1270053,69.319319,0.0,0.0,1.0,2020-01-01,1901.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
161555,zimbabwe,ZWE,Sub-Saharan Africa,Lower middle income,Zimbabwe Open University,1993.0,0.0,"-17.6887391, 31.0914758",-17.6887391,31.0914758,0.0,NaN,NaN,2010-01-01,13773.0
161556,zimbabwe,ZWE,Sub-Saharan Africa,Lower middle income,Zimbabwe Open University,1993.0,0.0,"-17.6887391, 31.0914758",-17.6887391,31.0914758,0.0,NaN,NaN,2015-01-01,11662.0
161557,zimbabwe,ZWE,Sub-Saharan Africa,Lower middle income,Zimbabwe Open University,1993.0,0.0,"-17.6887391, 31.0914758",-17.6887391,31.0914758,1.0,1.0,1.0,2020-01-01,22265.0
161558,zimbabwe,ZWE,Sub-Saharan Africa,Lower middle income,Zimbabwe Ezekiel Gut University,2012.0,1.0,"-17.3152904, 31.365549",-17.3152904,31.365549,0.0,NaN,NaN,2015-01-01,1262.0
161559,zimbabwe,ZWE,Sub-Saharan Africa,Lower middle income,Zimbabwe Ezekiel Gut University,2012.0,1.0,"-17.3152904, 31.365549",-17.3152904,31.365549,0.0,1.0,1.0,2020-01-01,1347.0

In [8]:
# Fixing nan
df = df[~df['latitude'].isna()]
df = df[~df['longitude'].isna()]
df = df[~df['Number of Student'].isna()]

In [9]:
# format and refactor values to be more user-friendly and nice-to-see in the map
df['Country'] = df['Country'].apply(lambda x: x.title())
df['University'] = df['University'].apply(lambda x: x.title())
df['University'] = df['University'].apply(lambda x: x.replace('\\N', ' - ').title())

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 127649 entries, 0 to 161559
Data columns (total 15 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   Country            127649 non-null  object
 1   countrycode        127102 non-null  object
 2   region             127102 non-null  object
 3   incomegroup        127102 non-null  object
 4   University         127649 non-null  object
 5   Founded in         127649 non-null  float64
 6   private01          127649 non-null  float64
 7   coordinates        127649 non-null  object
 8   latitude           127649 non-null  object
 9   longitude          127649 non-null  object
 10  PhD                127649 non-null  float64
 11  Master             20506 non-null   float64
 12  Bachelor           20506 non-null   float64
 13  year               127649 non-null  datetime64[ns]
 14  Number of Student  127649 non-null  float64
dtypes: datetime64[ns](1), float64(6), object(8)
memory usage: 15.6+ MB

## Count enrolments from Each Country

In [11]:
df['Number of Student'] = df['Number of Student'].fillna(0).apply(int)

In [12]:
# Count enrolments from each country

country_counts = df.groupby(['Country','countrycode','region','latitude','longitude','Founded in'])['Number of Student'].agg('sum').reset_index()
country_counts = country_counts.sort_values(by='Number of Student')
country_counts = country_counts.rename(columns={'Number of Student': 'students'})
country_counts.to_csv('csv/processed/country_enrolment_processed.csv',index=False)
# if verbose:
#     print(country_counts.head(remove_index()))

## Enrolments from each region

In [13]:
# Count enrolments from each country

region_counts = df.groupby(['region'])['Number of Student'].agg('sum').reset_index()
# country_counts = country_counts.sort_values(by='Number of Student')
region_counts = region_counts.rename(columns={'Number of Student': 'students'})
region_counts.to_csv('csv/processed/region_enrolment_processed.csv',index=False)
if verbose:
    print(region_counts)

                         region   students
0         East Asia and Pacific  213809094
1       Europe and Central Asia  224219259
2   Latin America and Caribbean  134933052
3  Middle East and North Africa   58774877
4                 North America   68942778
5                    South Asia  112108700
6            Sub-Saharan Africa   30113437

## Enrolments from each country

In [14]:
# Count enrolments from each country

region_counts = df.groupby(['Country','countrycode'])['Number of Student'].agg('sum').reset_index()
region_counts = region_counts.rename(columns={'Number of Student': 'students'})
region_counts.to_csv('csv/processed/country_student_count.csv',index=False)
if verbose:
    print(region_counts)

         Country countrycode  students
0    Afghanistan         AFG    555026
1        Albania         ALB    558980
2        Algeria         DZA   4493616
3        Andorra         AND      7431
4         Angola         AGO    588468
..           ...         ...       ...
182    Venezuela         VEN   5862043
183      Vietnam         VNM   6963903
184        Yemen         YEM    599588
185       Zambia         ZMB    270518
186     Zimbabwe         ZWE    423472

[187 rows x 3 columns]

## Count enrolment from Each Income Group

In [16]:
# Count enrolments from each income group
income_group_counts = df.groupby(['incomegroup'])['Number of Student'].agg('sum').reset_index()
income_group_counts.to_csv('csv/processed/income_group_count.csv',index=False)
if verbose:
    print(income_group_counts)

           incomegroup  Number of Student
0          High income          279100784
1           Low income           21003981
2  Lower middle income          228999209
3  Upper middle income          313797223

## Total enrolments yearwise and from each incomegroup

In [17]:
income_group_by_year = df.groupby(['year', 'incomegroup'])['Number of Student'].agg('sum').reset_index()
income_group_by_year.to_csv('csv/processed/income_group_by_year.csv',index=False)
print(income_group_by_year)

         year          incomegroup  Number of Student
0  1950-01-01          High income            3865348
1  1950-01-01           Low income               9749
2  1950-01-01  Lower middle income             675920
3  1950-01-01  Upper middle income             830549
4  1955-01-01          High income            4521373
5  1955-01-01           Low income              19926
6  1955-01-01  Lower middle income             908247
7  1955-01-01  Upper middle income            1168170
8  1960-01-01          High income            5379428
9  1960-01-01           Low income              82146
10 1960-01-01  Lower middle income            1659381
11 1960-01-01  Upper middle income            2244256
12 1965-01-01          High income            6686537
13 1965-01-01           Low income             147164
14 1965-01-01  Lower middle income            2671820
15 1965-01-01  Upper middle income            3220454
16 1970-01-01          High income            8705792
17 1970-01-01           Low income             258139
18 1970-01-01  Lower middle income            4152659
19 1970-01-01  Upper middle income            4657680
20 1975-01-01          High income           11160007
21 1975-01-01           Low income             397690
22 1975-01-01  Lower middle income            6564630
23 1975-01-01  Upper middle income            7044174
24 1980-01-01          High income           13402261
25 1980-01-01           Low income             576380
26 1980-01-01  Lower middle income            8141100
27 1980-01-01  Upper middle income            9598727
28 1985-01-01          High income           15463393
29 1985-01-01           Low income             697138
30 1985-01-01  Lower middle income           10326365
31 1985-01-01  Upper middle income           12564164
32 1990-01-01          High income           18557702
33 1990-01-01           Low income             877582
34 1990-01-01  Lower middle income           12724344
35 1990-01-01  Upper middle income           15410818
36 1995-01-01          High income           22126059
37 1995-01-01           Low income            1136080
38 1995-01-01  Lower middle income           15941731
39 1995-01-01  Upper middle income           19474968
40 2000-01-01          High income           25817275
41 2000-01-01           Low income            1635911
42 2000-01-01  Lower middle income           20538558
43 2000-01-01  Upper middle income           26279236
44 2005-01-01          High income           29765366
45 2005-01-01           Low income            2307850
46 2005-01-01  Lower middle income           25720465
47 2005-01-01  Upper middle income           35927119
48 2010-01-01          High income           33710848
49 2010-01-01           Low income            3235062
50 2010-01-01  Lower middle income           32379365
51 2010-01-01  Upper middle income           48428587
52 2015-01-01          High income           37555867
53 2015-01-01           Low income            4347416
54 2015-01-01  Lower middle income           38780900
55 2015-01-01  Upper middle income           59363750
56 2020-01-01          High income           42383528
57 2020-01-01           Low income            5275748
58 2020-01-01  Lower middle income           47813724
59 2020-01-01  Upper middle income           67584571

## Count enrolments yearwise

In [18]:
# year wise enrolment
year_wise = df.groupby(['year'])['Number of Student'].agg('sum').reset_index()
year_wise.to_csv('csv/processed/yearwise_enrolment.csv',index=False)
if verbose:
    print(year_wise)

         year  Number of Student
0  1950-01-01            5386106
1  1955-01-01            6630699
2  1960-01-01            9384192
3  1965-01-01           12753551
4  1970-01-01           17822731
5  1975-01-01           25238733
6  1980-01-01           31805364
7  1985-01-01           39147983
8  1990-01-01           47695827
9  1995-01-01           58865676
10 2000-01-01           74502709
11 2005-01-01           94246669
12 2010-01-01          118358965
13 2015-01-01          140749553
14 2020-01-01          163788588

## Yearwise Private / Public split

In [19]:
private_public_by_year = df.groupby(['year', 'private01'])['Number of Student'].agg('sum').reset_index()
private_public_by_year.to_csv('csv/processed/private_by_year.csv',index=False)
print(private_public_by_year)

         year  private01  Number of Student
0  1950-01-01        0.0            4188509
1  1950-01-01        1.0            1197597
2  1955-01-01        0.0            5222437
3  1955-01-01        1.0            1408262
4  1960-01-01        0.0            7410754
5  1960-01-01        1.0            1973438
6  1965-01-01        0.0           10141061
7  1965-01-01        1.0            2612490
8  1970-01-01        0.0           14278199
9  1970-01-01        1.0            3544532
10 1975-01-01        0.0           20535151
11 1975-01-01        1.0            4703582
12 1980-01-01        0.0           25831690
13 1980-01-01        1.0            5973674
14 1985-01-01        0.0           31447302
15 1985-01-01        1.0            7700681
16 1990-01-01        0.0           37786503
17 1990-01-01        1.0            9909324
18 1995-01-01        0.0           45867791
19 1995-01-01        1.0           12997885
20 2000-01-01        0.0           56682732
21 2000-01-01        1.0           17819977
22 2005-01-01        0.0           68971793
23 2005-01-01        1.0           25274876
24 2010-01-01        0.0           85485311
25 2010-01-01        1.0           32873654
26 2015-01-01        0.0          100832743
27 2015-01-01        1.0           39916810
28 2020-01-01        0.0          118202154
29 2020-01-01        1.0           45586434

In [20]:
df.head()

,Country,countrycode,region,incomegroup,University,Founded in,private01,coordinates,latitude,longitude,PhD,Master,Bachelor,year,Number of Student
0,Afghanistan,AFG,South Asia,Low income,Alberoni University,1998.0,0.0,"35.1270053, 69.3193192",35.1270053,69.319319,0.0,NaN,NaN,2000-01-01,1546
1,Afghanistan,AFG,South Asia,Low income,Alberoni University,1998.0,0.0,"35.1270053, 69.3193192",35.1270053,69.319319,0.0,NaN,NaN,2005-01-01,2106
2,Afghanistan,AFG,South Asia,Low income,Alberoni University,1998.0,0.0,"35.1270053, 69.3193192",35.1270053,69.319319,0.0,NaN,NaN,2010-01-01,2317
3,Afghanistan,AFG,South Asia,Low income,Alberoni University,1998.0,0.0,"35.1270053, 69.3193192",35.1270053,69.319319,0.0,NaN,NaN,2015-01-01,1835
4,Afghanistan,AFG,South Asia,Low income,Alberoni University,1998.0,0.0,"35.1270053, 69.3193192",35.1270053,69.319319,0.0,0.0,1.0,2020-01-01,1901

## Count total universities in each country

In [21]:
df.groupby(['Country','University'])['Country'].count()

Country      University
Afghanistan  Afghanistan National Agricultural Sciences And Technology University     2
             Air University                                                           3
             Alberoni University                                                      5
             American University Of Afghanistan                                       3
             Ariana University                                                        4
                                                                                     ..
Zimbabwe     University Of Zimbabwe                                                  14
             University Solution                                                     13
             Women'S University In Africa                                             4
             Zimbabwe Ezekiel Gut University                                          2
             Zimbabwe Open University                                                 6
Name: Country, Length: 15572, dtype: int64

## Count total universities in the world

In [22]:
df.University.nunique()

15426

In [23]:
#Count students studying in 2020
import datetime as dt
df['Date'] = pd.to_datetime(df['year'])

include = df[df['Date'].dt.year == 2020]

In [24]:
total_students_2020 = include.groupby(['year'])['Number of Student'].agg('sum').reset_index()

In [25]:
total_students_2020

        year  Number of Student
0 2020-01-01          163788588

In [26]:
# DF for country and university
df.groupby(['University'])['Founded in'].agg('max')

University
17 August 1945 University Cirebon                                1962.0
17 August 1945 University Jakarta                                1945.0
17 August 1945 University Samarinda                              1965.0
17 August 1945 University Semarang                               1963.0
17 August 1945 University Surabaya                               1956.0
                                                                  ...
ï¿½ï¿½ï¿½Buraydah College For Applied Medical Sciences                 2005.0
ï¿½ï¿½ï¿½Buraydah College Of Administrative Sciences And Humanities    2006.0
ï¿½ï¿½ï¿½Buraydah College Of Dentistry And Pharmacy                    2004.0
ï¿½ï¿½ï¿½Buraydah College Of Engineering And Information Technology    2005.0
ï¿½ï¿½ï¿½ï¿½Dir University                                               2008.0
Name: Founded in, Length: 15426, dtype: float64

In [27]:
df.fillna(0)

,Country,countrycode,region,incomegroup,University,Founded in,private01,coordinates,latitude,longitude,PhD,Master,Bachelor,year,Number of Student,Date
0,Afghanistan,AFG,South Asia,Low income,Alberoni University,1998.0,0.0,"35.1270053, 69.3193192",35.1270053,69.319319,0.0,0.0,0.0,2000-01-01,1546,2000-01-01
1,Afghanistan,AFG,South Asia,Low income,Alberoni University,1998.0,0.0,"35.1270053, 69.3193192",35.1270053,69.319319,0.0,0.0,0.0,2005-01-01,2106,2005-01-01
2,Afghanistan,AFG,South Asia,Low income,Alberoni University,1998.0,0.0,"35.1270053, 69.3193192",35.1270053,69.319319,0.0,0.0,0.0,2010-01-01,2317,2010-01-01
3,Afghanistan,AFG,South Asia,Low income,Alberoni University,1998.0,0.0,"35.1270053, 69.3193192",35.1270053,69.319319,0.0,0.0,0.0,2015-01-01,1835,2015-01-01
4,Afghanistan,AFG,South Asia,Low income,Alberoni University,1998.0,0.0,"35.1270053, 69.3193192",35.1270053,69.319319,0.0,0.0,1.0,2020-01-01,1901,2020-01-01
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
161555,Zimbabwe,ZWE,Sub-Saharan Africa,Lower middle income,Zimbabwe Open University,1993.0,0.0,"-17.6887391, 31.0914758",-17.6887391,31.0914758,0.0,0.0,0.0,2010-01-01,13773,2010-01-01
161556,Zimbabwe,ZWE,Sub-Saharan Africa,Lower middle income,Zimbabwe Open University,1993.0,0.0,"-17.6887391, 31.0914758",-17.6887391,31.0914758,0.0,0.0,0.0,2015-01-01,11662,2015-01-01
161557,Zimbabwe,ZWE,Sub-Saharan Africa,Lower middle income,Zimbabwe Open University,1993.0,0.0,"-17.6887391, 31.0914758",-17.6887391,31.0914758,1.0,1.0,1.0,2020-01-01,22265,2020-01-01
161558,Zimbabwe,ZWE,Sub-Saharan Africa,Lower middle income,Zimbabwe Ezekiel Gut University,2012.0,1.0,"-17.3152904, 31.365549",-17.3152904,31.365549,0.0,0.0,0.0,2015-01-01,1262,2015-01-01
161559,Zimbabwe,ZWE,Sub-Saharan Africa,Lower middle income,Zimbabwe Ezekiel Gut University,2012.0,1.0,"-17.3152904, 31.365549",-17.3152904,31.365549,0.0,1.0,1.0,2020-01-01,1347,2020-01-01

In [28]:
df.value_counts('region')

region
East Asia and Pacific           37827
Europe and Central Asia         36540
Latin America and Caribbean     19733
North America                   12470
South Asia                       7080
Sub-Saharan Africa               6967
Middle East and North Africa     6485
dtype: int64

Bachlors/Masters/Phd Grants By Each Country

In [44]:
bachelor= df.copy()
masters = df.copy()
phd = df.copy()

In [45]:
bachelor.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 127649 entries, 0 to 161559
Data columns (total 16 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   Country            127649 non-null  object
 1   countrycode        127102 non-null  object
 2   region             127102 non-null  object
 3   incomegroup        127102 non-null  object
 4   University         127649 non-null  object
 5   Founded in         127649 non-null  float64
 6   private01          127649 non-null  float64
 7   coordinates        127649 non-null  object
 8   latitude           127649 non-null  object
 9   longitude          127649 non-null  object
 10  PhD                127649 non-null  float64
 11  Master             20506 non-null   float64
 12  Bachelor           20506 non-null   float64
 13  year               127649 non-null  datetime64[ns]
 14  Number of Student  127649 non-null  int64
 15  Date               127649 non-null  datetime64[ns]
dtypes: datetime64[ns](2), float64(5), int64(1), object(8)
memory usage: 16.6+ MB

In [46]:
phd = phd[['Country','PhD']].groupby('Country').sum()
masters = masters[['Country','Master']].groupby('Country').sum()
bachelor = bachelor[['Country', 'Bachelor']].groupby('Country').sum()

In [50]:
PhD_by_country = phd.copy()
PhD_by_country.to_csv('csv/processed/bachelor_by_country.csv',index=False)

In [49]:
masters_by_country= masters.copy()
masters_by_country.to_csv('csv/processed/bachelor_by_country.csv',index=False)

In [48]:
bachelor_by_country = bachelor.copy()
bachelor_by_country.to_csv('csv/processed/bachelor_by_country.csv',index=False)